smutrux/WLED-Controller/sdkconfig.defaults
# sdkconfig.defaults
# Waveshare ESP32-S3 Touch LCD 3.5"
# Applied automatically by `idf.py reconfigure` when no sdkconfig exists.
# Commit this file; do NOT commit sdkconfig itself (add to .gitignore).

# ── Chip / Flash ─────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ── Partition table ─────────────────────────────────────────────────────────
# Default table only gives 1 MB to the app; our binary exceeds that.
# partitions.csv gives 3 MB to factory on the 16 MB flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM (OPI PSRAM on this board) ─────────────────────────────────────────
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y          # makes heap_caps_malloc(MALLOC_CAP_SPIRAM) work
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ── CPU ──────────────────────────────────────────────────────────────────────
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# ── USB Serial (ESP32-S3 has built-in USB CDC) ───────────────────────────────
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ── Stack sizes ──────────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── Logging ──────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── LVGL (via Kconfig exposed by the lvgl component) ────────────────────────
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=256
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=y
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_BTN=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_COLORWHEEL=y
CONFIG_LV_USE_SPINNER=y

# Suppress legacy I2C driver EOL warning (safe to use until IDF v7.0)
CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y
